Revit 2026 API

# IndependentTagSetLeaderElbow Method

---

Set the position of the elbow of the tag's leader that points to specified reference. If this tag is a multileader tag and the elbows are merged, the input position will be set to all leaders.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLeaderElbow(
	Reference referenceTagged,
	XYZ elbowPosition
)
```
```vb
Public Sub SetLeaderElbow (
	referenceTagged As Reference,
	elbowPosition As XYZ
)
```
```cpp
public:
void SetLeaderElbow(
	Reference^ referenceTagged,
	XYZ^ elbowPosition
)
```
```fsharp
member SetLeaderElbow :
        referenceTagged : Reference *
        elbowPosition : XYZ -> unit
```

#### Parameters

referenceTagged Reference
     The reference which is tagged.
elbowPosition XYZ
     The position of the elbow.

| Exception | Condition |
| --- | --- |
| ArgumentException | The specified reference is not currently tagged. -or- The leader for the tagged reference isn't visible. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The IndependentTag object does not have a tag behavior. -or- For this tag leaders are not allowed. |

Straight leaders do not have elbow points.

#### Reference

IndependentTag Class

Autodesk.Revit.DB Namespace